; domain
(define (domain sokoban)
  (:requirements :typing :action-costs)
  (:types thing location direction - object
          player stone - thing)
  (:predicates (clear ?l - location)
	       (at ?t - thing ?l - location)
	       (at-goal ?s - stone)
	       (IS-GOAL ?l - location)
	       (IS-NONGOAL ?l - location)
               (MOVE-DIR ?from ?to - location ?dir - direction))
  

  (:action move
   :parameters (?p - player ?from ?to - location ?dir - direction)
   :precondition (and (at ?p ?from)
                      (clear ?to)
                      (MOVE-DIR ?from ?to ?dir)
                      )
   :effect       (and (not (at ?p ?from))
                      (not (clear ?to))
                      (at ?p ?to)
                      (clear ?from)
                      )
   )

  (:action push-to-nongoal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-NONGOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (not (at-goal ?s))
                      )
   )

  (:action push-to-goal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-GOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (at-goal ?s)
                      )
   )
)

; problem
;;     ####
;;   ###+@#
;;   #@#*@#
;; ### @*@#
;; #@$***@#
;; ##@@@@##
;;  ######

(define (problem p004-multiban-temporal)
  (:domain sokoban)
  (:objects
    dir-down - direction
    dir-left - direction
    dir-right - direction
    dir-up - direction
    player-01 - player
    player-02 - player
    player-03 - player
    player-04 - player
    player-05 - player
    player-06 - player
    player-07 - player
    player-08 - player
    player-09 - player
    player-10 - player
    player-11 - player
    player-12 - player
    pos-1-1 - location
    pos-1-2 - location
    pos-1-3 - location
    pos-1-4 - location
    pos-1-5 - location
    pos-1-6 - location
    pos-1-7 - location
    pos-2-1 - location
    pos-2-2 - location
    pos-2-3 - location
    pos-2-4 - location
    pos-2-5 - location
    pos-2-6 - location
    pos-2-7 - location
    pos-3-1 - location
    pos-3-2 - location
    pos-3-3 - location
    pos-3-4 - location
    pos-3-5 - location
    pos-3-6 - location
    pos-3-7 - location
    pos-4-1 - location
    pos-4-2 - location
    pos-4-3 - location
    pos-4-4 - location
    pos-4-5 - location
    pos-4-6 - location
    pos-4-7 - location
    pos-5-1 - location
    pos-5-2 - location
    pos-5-3 - location
    pos-5-4 - location
    pos-5-5 - location
    pos-5-6 - location
    pos-5-7 - location
    pos-6-1 - location
    pos-6-2 - location
    pos-6-3 - location
    pos-6-4 - location
    pos-6-5 - location
    pos-6-6 - location
    pos-6-7 - location
    pos-7-1 - location
    pos-7-2 - location
    pos-7-3 - location
    pos-7-4 - location
    pos-7-5 - location
    pos-7-6 - location
    pos-7-7 - location
    pos-8-1 - location
    pos-8-2 - location
    pos-8-3 - location
    pos-8-4 - location
    pos-8-5 - location
    pos-8-6 - location
    pos-8-7 - location
    stone-01 - stone
    stone-02 - stone
    stone-03 - stone
    stone-04 - stone
    stone-05 - stone
    stone-06 - stone
  )
  (:init
    (IS-GOAL pos-4-5)
    (IS-GOAL pos-5-5)
    (IS-GOAL pos-6-2)
    (IS-GOAL pos-6-3)
    (IS-GOAL pos-6-4)
    (IS-GOAL pos-6-5)
    (IS-NONGOAL pos-1-1)
    (IS-NONGOAL pos-1-2)
    (IS-NONGOAL pos-1-3)
    (IS-NONGOAL pos-1-4)
    (IS-NONGOAL pos-1-5)
    (IS-NONGOAL pos-1-6)
    (IS-NONGOAL pos-1-7)
    (IS-NONGOAL pos-2-1)
    (IS-NONGOAL pos-2-2)
    (IS-NONGOAL pos-2-3)
    (IS-NONGOAL pos-2-4)
    (IS-NONGOAL pos-2-5)
    (IS-NONGOAL pos-2-6)
    (IS-NONGOAL pos-2-7)
    (IS-NONGOAL pos-3-1)
    (IS-NONGOAL pos-3-2)
    (IS-NONGOAL pos-3-3)
    (IS-NONGOAL pos-3-4)
    (IS-NONGOAL pos-3-5)
    (IS-NONGOAL pos-3-6)
    (IS-NONGOAL pos-3-7)
    (IS-NONGOAL pos-4-1)
    (IS-NONGOAL pos-4-2)
    (IS-NONGOAL pos-4-3)
    (IS-NONGOAL pos-4-4)
    (IS-NONGOAL pos-4-6)
    (IS-NONGOAL pos-4-7)
    (IS-NONGOAL pos-5-1)
    (IS-NONGOAL pos-5-2)
    (IS-NONGOAL pos-5-3)
    (IS-NONGOAL pos-5-4)
    (IS-NONGOAL pos-5-6)
    (IS-NONGOAL pos-5-7)
    (IS-NONGOAL pos-6-1)
    (IS-NONGOAL pos-6-6)
    (IS-NONGOAL pos-6-7)
    (IS-NONGOAL pos-7-1)
    (IS-NONGOAL pos-7-2)
    (IS-NONGOAL pos-7-3)
    (IS-NONGOAL pos-7-4)
    (IS-NONGOAL pos-7-5)
    (IS-NONGOAL pos-7-6)
    (IS-NONGOAL pos-7-7)
    (IS-NONGOAL pos-8-1)
    (IS-NONGOAL pos-8-2)
    (IS-NONGOAL pos-8-3)
    (IS-NONGOAL pos-8-4)
    (IS-NONGOAL pos-8-5)
    (IS-NONGOAL pos-8-6)
    (IS-NONGOAL pos-8-7)
    (MOVE-DIR pos-1-1 pos-1-2 dir-down)
    (MOVE-DIR pos-1-1 pos-2-1 dir-right)
    (MOVE-DIR pos-1-2 pos-1-1 dir-up)
    (MOVE-DIR pos-1-2 pos-1-3 dir-down)
    (MOVE-DIR pos-1-2 pos-2-2 dir-right)
    (MOVE-DIR pos-1-3 pos-1-2 dir-up)
    (MOVE-DIR pos-1-3 pos-2-3 dir-right)
    (MOVE-DIR pos-2-1 pos-1-1 dir-left)
    (MOVE-DIR pos-2-1 pos-2-2 dir-down)
    (MOVE-DIR pos-2-1 pos-3-1 dir-right)
    (MOVE-DIR pos-2-2 pos-1-2 dir-left)
    (MOVE-DIR pos-2-2 pos-2-1 dir-up)
    (MOVE-DIR pos-2-2 pos-2-3 dir-down)
    (MOVE-DIR pos-2-3 pos-1-3 dir-left)
    (MOVE-DIR pos-2-3 pos-2-2 dir-up)
    (MOVE-DIR pos-2-5 pos-3-5 dir-right)
    (MOVE-DIR pos-3-1 pos-2-1 dir-left)
    (MOVE-DIR pos-3-1 pos-4-1 dir-right)
    (MOVE-DIR pos-3-5 pos-2-5 dir-left)
    (MOVE-DIR pos-3-5 pos-3-6 dir-down)
    (MOVE-DIR pos-3-5 pos-4-5 dir-right)
    (MOVE-DIR pos-3-6 pos-3-5 dir-up)
    (MOVE-DIR pos-3-6 pos-4-6 dir-right)
    (MOVE-DIR pos-4-1 pos-3-1 dir-left)
    (MOVE-DIR pos-4-3 pos-4-4 dir-down)
    (MOVE-DIR pos-4-4 pos-4-3 dir-up)
    (MOVE-DIR pos-4-4 pos-4-5 dir-down)
    (MOVE-DIR pos-4-4 pos-5-4 dir-right)
    (MOVE-DIR pos-4-5 pos-3-5 dir-left)
    (MOVE-DIR pos-4-5 pos-4-4 dir-up)
    (MOVE-DIR pos-4-5 pos-4-6 dir-down)
    (MOVE-DIR pos-4-5 pos-5-5 dir-right)
    (MOVE-DIR pos-4-6 pos-3-6 dir-left)
    (MOVE-DIR pos-4-6 pos-4-5 dir-up)
    (MOVE-DIR pos-4-6 pos-5-6 dir-right)
    (MOVE-DIR pos-5-4 pos-4-4 dir-left)
    (MOVE-DIR pos-5-4 pos-5-5 dir-down)
    (MOVE-DIR pos-5-4 pos-6-4 dir-right)
    (MOVE-DIR pos-5-5 pos-4-5 dir-left)
    (MOVE-DIR pos-5-5 pos-5-4 dir-up)
    (MOVE-DIR pos-5-5 pos-5-6 dir-down)
    (MOVE-DIR pos-5-5 pos-6-5 dir-right)
    (MOVE-DIR pos-5-6 pos-4-6 dir-left)
    (MOVE-DIR pos-5-6 pos-5-5 dir-up)
    (MOVE-DIR pos-5-6 pos-6-6 dir-right)
    (MOVE-DIR pos-6-2 pos-6-3 dir-down)
    (MOVE-DIR pos-6-2 pos-7-2 dir-right)
    (MOVE-DIR pos-6-3 pos-6-2 dir-up)
    (MOVE-DIR pos-6-3 pos-6-4 dir-down)
    (MOVE-DIR pos-6-3 pos-7-3 dir-right)
    (MOVE-DIR pos-6-4 pos-5-4 dir-left)
    (MOVE-DIR pos-6-4 pos-6-3 dir-up)
    (MOVE-DIR pos-6-4 pos-6-5 dir-down)
    (MOVE-DIR pos-6-4 pos-7-4 dir-right)
    (MOVE-DIR pos-6-5 pos-5-5 dir-left)
    (MOVE-DIR pos-6-5 pos-6-4 dir-up)
    (MOVE-DIR pos-6-5 pos-6-6 dir-down)
    (MOVE-DIR pos-6-5 pos-7-5 dir-right)
    (MOVE-DIR pos-6-6 pos-5-6 dir-left)
    (MOVE-DIR pos-6-6 pos-6-5 dir-up)
    (MOVE-DIR pos-7-2 pos-6-2 dir-left)
    (MOVE-DIR pos-7-2 pos-7-3 dir-down)
    (MOVE-DIR pos-7-3 pos-6-3 dir-left)
    (MOVE-DIR pos-7-3 pos-7-2 dir-up)
    (MOVE-DIR pos-7-3 pos-7-4 dir-down)
    (MOVE-DIR pos-7-4 pos-6-4 dir-left)
    (MOVE-DIR pos-7-4 pos-7-3 dir-up)
    (MOVE-DIR pos-7-4 pos-7-5 dir-down)
    (MOVE-DIR pos-7-5 pos-6-5 dir-left)
    (MOVE-DIR pos-7-5 pos-7-4 dir-up)
    (at player-01 pos-6-2)
    (at player-02 pos-7-2)
    (at player-03 pos-4-3)
    (at player-04 pos-7-3)
    (at player-05 pos-5-4)
    (at player-06 pos-7-4)
    (at player-07 pos-2-5)
    (at player-08 pos-7-5)
    (at player-09 pos-3-6)
    (at player-10 pos-4-6)
    (at player-11 pos-5-6)
    (at player-12 pos-6-6)
    (at stone-01 pos-6-3)
    (at stone-02 pos-6-4)
    (at stone-03 pos-3-5)
    (at stone-04 pos-4-5)
    (at stone-05 pos-5-5)
    (at stone-06 pos-6-5)
    (at-goal stone-01)
    (at-goal stone-02)
    (at-goal stone-04)
    (at-goal stone-05)
    (at-goal stone-06)
    (clear pos-1-1)
    (clear pos-1-2)
    (clear pos-1-3)
    (clear pos-1-7)
    (clear pos-2-1)
    (clear pos-2-2)
    (clear pos-2-3)
    (clear pos-3-1)
    (clear pos-4-1)
    (clear pos-4-4)
    (clear pos-8-7)
  )
  (:goal (and
    (at-goal stone-01)
    (at-goal stone-02)
    (at-goal stone-03)
    (at-goal stone-04)
    (at-goal stone-05)
    (at-goal stone-06)
  ))
  
)

; plan
1. (move player-05 pos-5-4 pos-4-4 dir-left)
   deleted: (at player-05 pos-5-4) (clear pos-4-4)
   added: (at player-05 pos-4-4) (clear pos-5-4)
   goals met: 5 of 6
2. (push-to-nongoal player-06 stone-02 pos-7-4 pos-6-4 pos-5-4 dir-left)
   deleted: (at player-06 pos-7-4) (at stone-02 pos-6-4) (clear pos-5-4) (at-goal stone-02)
   added: (at player-06 pos-6-4) (at stone-02 pos-5-4) (clear pos-7-4)
   goals met: 4 of 6
3. (move player-04 pos-7-3 pos-7-4 dir-down)
   deleted: (at player-04 pos-7-3) (clear pos-7-4)
   added: (at player-04 pos-7-4) (clear pos-7-3)
   goals met: 4 of 6
4. (move player-02 pos-7-2 pos-7-3 dir-down)
   deleted: (at player-02 pos-7-2) (clear pos-7-3)
   added: (at player-02 pos-7-3) (clear pos-7-2)
   goals met: 4 of 6
5. (move player-01 pos-6-2 pos-7-2 dir-right)
   deleted: (at player-01 pos-6-2) (clear pos-7-2)
   added: (at player-01 pos-7-2) (clear pos-6-2)
   goals met: 4 of 6
6. (push-to-goal player-06 stone-01 pos-6-4 pos-6-3 pos-6-2 dir-up)
   deleted: (at player-06 pos-6-4) (at stone-01 pos-6-3) (clear pos-6-2)
   added: (at player-06 pos-6-3) (at stone-01 pos-6-2) (clear pos-6-4)
   goals met: 4 of 6
7. (push-to-goal player-12 stone-06 pos-6-6 pos-6-5 pos-6-4 dir-up)
   deleted: (at player-12 pos-6-6) (at stone-06 pos-6-5) (clear pos-6-4)
   added: (at player-12 pos-6-5) (at stone-06 pos-6-4) (clear pos-6-6)
   goals met: 4 of 6
8. (move player-12 pos-6-5 pos-6-6 dir-down)
   deleted: (at player-12 pos-6-5) (clear pos-6-6)
   added: (at player-12 pos-6-6) (clear pos-6-5)
   goals met: 4 of 6
9. (move player-08 pos-7-5 pos-6-5 dir-left)
   deleted: (at player-08 pos-7-5) (clear pos-6-5)
   added: (at player-08 pos-6-5) (clear pos-7-5)
   goals met: 4 of 6
10. (move player-04 pos-7-4 pos-7-5 dir-down)
   deleted: (at player-04 pos-7-4) (clear pos-7-5)
   added: (at player-04 pos-7-5) (clear pos-7-4)
   goals met: 4 of 6
11. (move player-02 pos-7-3 pos-7-4 dir-down)
   deleted: (at player-02 pos-7-3) (clear pos-7-4)
   added: (at player-02 pos-7-4) (clear pos-7-3)
   goals met: 4 of 6
12. (move player-06 pos-6-3 pos-7-3 dir-right)
   deleted: (at player-06 pos-6-3) (clear pos-7-3)
   added: (at player-06 pos-7-3) (clear pos-6-3)
   goals met: 4 of 6
13. (push-to-goal player-08 stone-06 pos-6-5 pos-6-4 pos-6-3 dir-up)
   deleted: (at player-08 pos-6-5) (at stone-06 pos-6-4) (clear pos-6-3)
   added: (at player-08 pos-6-4) (at stone-06 pos-6-3) (clear pos-6-5)
   goals met: 4 of 6
14. (move player-08 pos-6-4 pos-6-5 dir-down)
   deleted: (at player-08 pos-6-4) (clear pos-6-5)
   added: (at player-08 pos-6-5) (clear pos-6-4)
   goals met: 4 of 6
15. (push-to-goal player-05 stone-02 pos-4-4 pos-5-4 pos-6-4 dir-right)
   deleted: (at player-05 pos-4-4) (at stone-02 pos-5-4) (clear pos-6-4)
   added: (at player-05 pos-5-4) (at stone-02 pos-6-4) (clear pos-4-4) (at-goal stone-02)
   goals met: 5 of 6
16. (push-to-nongoal player-10 stone-04 pos-4-6 pos-4-5 pos-4-4 dir-up)
   deleted: (at player-10 pos-4-6) (at stone-04 pos-4-5) (clear pos-4-4) (at-goal stone-04)
   added: (at player-10 pos-4-5) (at stone-04 pos-4-4) (clear pos-4-6)
   goals met: 4 of 6
17. (move player-11 pos-5-6 pos-4-6 dir-left)
   deleted: (at player-11 pos-5-6) (clear pos-4-6)
   added: (at player-11 pos-4-6) (clear pos-5-6)
   goals met: 4 of 6
18. (move player-12 pos-6-6 pos-5-6 dir-left)
   deleted: (at player-12 pos-6-6) (clear pos-5-6)
   added: (at player-12 pos-5-6) (clear pos-6-6)
   goals met: 4 of 6
19. (move player-08 pos-6-5 pos-6-6 dir-down)
   deleted: (at player-08 pos-6-5) (clear pos-6-6)
   added: (at player-08 pos-6-6) (clear pos-6-5)
   goals met: 4 of 6
20. (push-to-goal player-10 stone-05 pos-4-5 pos-5-5 pos-6-5 dir-right)
   deleted: (at player-10 pos-4-5) (at stone-05 pos-5-5) (clear pos-6-5)
   added: (at player-10 pos-5-5) (at stone-05 pos-6-5) (clear pos-4-5)
   goals met: 4 of 6
21. (push-to-goal player-07 stone-03 pos-2-5 pos-3-5 pos-4-5 dir-right)
   deleted: (at player-07 pos-2-5) (at stone-03 pos-3-5) (clear pos-4-5)
   added: (at player-07 pos-3-5) (at stone-03 pos-4-5) (clear pos-2-5) (at-goal stone-03)
   goals met: 5 of 6
22. (move player-07 pos-3-5 pos-2-5 dir-left)
   deleted: (at player-07 pos-3-5) (clear pos-2-5)
   added: (at player-07 pos-2-5) (clear pos-3-5)
   goals met: 5 of 6
23. (move player-09 pos-3-6 pos-3-5 dir-up)
   deleted: (at player-09 pos-3-6) (clear pos-3-5)
   added: (at player-09 pos-3-5) (clear pos-3-6)
   goals met: 5 of 6
24. (move player-11 pos-4-6 pos-3-6 dir-left)
   deleted: (at player-11 pos-4-6) (clear pos-3-6)
   added: (at player-11 pos-3-6) (clear pos-4-6)
   goals met: 5 of 6
25. (move player-12 pos-5-6 pos-4-6 dir-left)
   deleted: (at player-12 pos-5-6) (clear pos-4-6)
   added: (at player-12 pos-4-6) (clear pos-5-6)
   goals met: 5 of 6
26. (move player-10 pos-5-5 pos-5-6 dir-down)
   deleted: (at player-10 pos-5-5) (clear pos-5-6)
   added: (at player-10 pos-5-6) (clear pos-5-5)
   goals met: 5 of 6
27. (push-to-goal player-09 stone-03 pos-3-5 pos-4-5 pos-5-5 dir-right)
   deleted: (at player-09 pos-3-5) (at stone-03 pos-4-5) (clear pos-5-5)
   added: (at player-09 pos-4-5) (at stone-03 pos-5-5) (clear pos-3-5)
   goals met: 5 of 6
28. (move player-09 pos-4-5 pos-3-5 dir-left)
   deleted: (at player-09 pos-4-5) (clear pos-3-5)
   added: (at player-09 pos-3-5) (clear pos-4-5)
   goals met: 5 of 6
29. (push-to-goal player-03 stone-04 pos-4-3 pos-4-4 pos-4-5 dir-down)
   deleted: (at player-03 pos-4-3) (at stone-04 pos-4-4) (clear pos-4-5)
   added: (at player-03 pos-4-4) (at stone-04 pos-4-5) (clear pos-4-3) (at-goal stone-04)
   goals met: 6 of 6
